import { BurgerIcon } from 'components/Welcome/Welcome.styled';
import {
  BrandBookDefaultText,
  BrandBookMainTitle,
  BrandBookPageContainer,
  BrandBookSubTitle,
  MainBrandBookContainer,
  SectionItemBlock,
} from './BrandBook.styled';
import { NavLink } from 'react-router-dom';
import { BackArrow } from '../Services.styled';
import SideBarMenu from 'components/SideBarMenu/SideBarMenu';
import { useState } from 'react';
import ContactForm from 'addition/ContactForm/ContactForm';

const BrandBook = () => {
  const [sidebarSwitcher, setSidebarSwitcher] = useState(false); // Стейт для управления состоянием меню

  const onClickGood = () => {
    setSidebarSwitcher(prevState => !prevState); // Переключение состояния меню
  };

  return (
    <MainBrandBookContainer>
      <BurgerIcon onClick={onClickGood} className="good" />
      <NavLink to="/" style={{ textDecoration: 'none' }}>
        <BackArrow />
      </NavLink>
      <SideBarMenu isOpen={sidebarSwitcher} />
      <BrandBookPageContainer>
        <SectionItemBlock>
          {' '}
          <BrandBookMainTitle>
            Брендбук: основа для побудови сильного бренду
          </BrandBookMainTitle>
          <BrandBookDefaultText>
            Створення впізнаваного образу компанії — надзвичайно важливе
            завдання для будь-якого бізнесу. Для цього існує спеціальний
            документ, який називається <strong>брендбук</strong>. Він допомагає
            вибудувати чітку систему правил і рекомендацій, які гарантують
            єдність усіх візуальних і комунікаційних елементів. Якщо ви прагнете
            виділитися на ринку та підвищити довіру до компанії, варто
            дізнатися, <strong>з чого складається брендбук</strong> і чому{' '}
            <strong>бренд бук це</strong> надзвичайно важливий крок у розвитку
            бренду.
          </BrandBookDefaultText>
          <BrandBookDefaultText>
            В основі будь-якого брендового посібника лежить{' '}
            <strong>фірмовий стиль</strong> — набір графічних та вербальних
            характеристик, які визначають, як саме ваша компанія має виглядати і
            “звучати”. Саме <strong>фірмовий стиль це</strong> фундамент для
            всіх наступних комунікацій: логотип, шрифти, кольори та спосіб
            спілкування з аудиторією. Якщо ви шукаєте інформацію про те, як
            формується <strong>фірмовий стиль відомих світових брендів</strong>,
            то знайдете чимало прикладів, які підкажуть основний напрям і
            допоможуть розробити власний унікальний стиль.
          </BrandBookDefaultText>
          <BrandBookDefaultText>
            Заглиблюючись у тему брендингу, ви неодмінно натрапите на{' '}
            <strong>брендбук приклад</strong> від різних компаній. Вони наочно
            демонструють, як складові ідентичності узгоджуються між собою. Серед
            найважливіших розділів — <strong>елементи фірмового стилю</strong>,
            структура корпоративних повідомлень, а також загальні поради щодо
            оформлення друкованих і цифрових матеріалів. До речі,{' '}
            <strong>брендбук ціна</strong> може варіюватися залежно від обсягу
            роботи та складності проєкту, але інвестиція майже завжди
            окуповується завдяки посиленню позицій на ринку.
          </BrandBookDefaultText>
        </SectionItemBlock>

        <SectionItemBlock>
          <BrandBookSubTitle>
            Що таке брендбук і навіщо він потрібен?
          </BrandBookSubTitle>
          <BrandBookDefaultText>
            <strong>Бренд бук це</strong> комплексний путівник, де чітко
            прописано стандарти використання айдентики. Іншими словами, це
            “біблія” вашого бренду, де зібрано{' '}
            <strong>основні складові фірмового стилю</strong> та принципи
            їхнього застосування. Якщо ми говоримо про{' '}
            <strong>з чого складається брендбук</strong>, то обов’язковими
            елементами є логотип, фірмові кольори, шрифти та тон спілкування.
          </BrandBookDefaultText>
          <BrandBookDefaultText>
            Подібний документ виконує кілька важливих функцій:
            <ol>
              <li>Забезпечує сталість усіх візуальних рішень і повідомлень.</li>
              <li>Допомагає команді дотримуватися єдиної концепції.</li>
              <li>
                Гарантує, що <strong>фірмовий стиль</strong> залишається
                впізнаваним незалежно від каналу комунікації.
              </li>
            </ol>
          </BrandBookDefaultText>
          <BrandBookDefaultText>
            Коли ви вивчаєте <strong>брендбук приклад</strong> іншої компанії,
            помічаєте узгодженість і впевненість бренду в усіх деталях. Таке
            враження формується завдяки єдності стилю та уніфікованому підходу
            до дизайну й текстів. Саме тому <strong>брендбук</strong> та його
            якісне оформлення так цінуються в сучасному бізнес-середовищі.
          </BrandBookDefaultText>
          <BrandBookSubTitle>Що входить до брендбука? </BrandBookSubTitle>
          <BrandBookDefaultText>
            Перш ніж розпочинати <strong>створення брендбуку</strong>, варто
            усвідомити <strong>етапи розробки фірмового стилю</strong>. Адже
            саме <strong>створення фірмового стилю</strong> є базою для
            майбутньої документації. Зазвичай, до складу брендбука включають:
            <ol>
              <li>
                <strong>Візуальні елементи фірмового стилю</strong>
                <ul>
                  <li>
                    <strong>Логотип для брендбука</strong>: допустимі варіанти
                    розміщення, пропорції, заборонені кольорові рішення.
                  </li>
                  <li>
                    Кольорова палітра: основні та додаткові кольори, а також
                    приклади їхнього поєднання.
                  </li>
                  <li>
                    Типографіка: списки шрифтів, розміри заголовків, стиль
                    тексту.
                  </li>
                  <li>
                    Фірмові графічні елементи: патерни, іконки та ілюстрації.
                  </li>
                </ul>
              </li>
              <li>
                Тон комунікації (Tone of Voice)
                <ul>
                  <li>
                    Принципи, за якими бренд спілкується з цільовою аудиторією.
                  </li>
                  <li>
                    Зразки текстів для постів у соцмережах, рекламних оголошень
                    та інших каналів.
                  </li>
                </ul>
              </li>
              <li>
                Правила використання
                <ul>
                  <li>
                    Рекомендації щодо коректного й некоректного застосування
                    логотипа та дизайну.{' '}
                  </li>
                  <li>Поради для друкованої та онлайн-продукції.</li>
                  <li>
                    Інструкції для партнерів і підрядників, аби{' '}
                    <strong>фірмовий стиль відомих світових брендів</strong> (та
                    ваш також) не втрачав цілісності.
                  </li>
                </ul>
              </li>
            </ol>
          </BrandBookDefaultText>
          <BrandBookSubTitle>
            Наші послуги зі створення брендбука{' '}
          </BrandBookSubTitle>
          <BrandBookDefaultText>
            Щоб отримати ефективний та довговічний документ, потрібна професійна{' '}
            <strong>розробка брендбука</strong>. Ми пропонуємо: -{' '}
            <strong>Створення брендбуку</strong> з нуля: від початкового аналізу
            ринку до фінального макета. - Оновлення або розширення поточного
            брендового посібника. - Маркетингові рекомендації, що перетворять{' '}
            <strong>брендбук</strong> на інструмент з чітким планом просування.
            - Розробку дизайн-концепцій, які включають{' '}
            <strong>логотип для брендбука</strong> та інші{' '}
            <strong>елементи фірмового стилю</strong>. - Комплексний підхід до
            візуальної ідентифікації: від <strong>дизайн брендбука</strong> до
            детальних інструкцій для команди та партнерів.
          </BrandBookDefaultText>
          <BrandBookDefaultText>
            Ми зосереджуємося не лише на візуальних складових, а й на
            комунікаційній стратегії бренду. Завдяки цьому брендбук стає
            практичним документом, котрий сприяє зростанню лояльності та
            розширенню клієнтської бази.
          </BrandBookDefaultText>
          <BrandBookSubTitle>Переваги співпраці з нами</BrandBookSubTitle>
          <BrandBookDefaultText>
            <ol>
              <li>
                Команда фахівців, яка досконало знає{' '}
                <strong>етапи розробки фірмового стилю</strong> та тонкощі
                створення унікального образу.
              </li>
              <li>
                Індивідуальний підхід: ми враховуємо специфіку вашої галузі й
                регіональні особливості, пропонуючи рішення, що найкраще
                відображають ваші цінності.
              </li>
              <li>
                Сучасні тренди в дизайні та маркетингу, які роблять ваш{' '}
                <strong>фірмовий стиль відомих світових брендів</strong>{' '}
                конкурентоспроможним і впізнаваним.
              </li>
              <li>
                {' '}
                Зрозуміла структура документа:{' '}
                <strong>з чого складається брендбук</strong> і як застосовувати
                його на практиці.
              </li>
              <li>
                Прозорі умови співпраці та чіткі терміни реалізації проєкту.
                Якщо вас цікавить <strong>брендбук ціна</strong>, ми надамо
                прорахунок на основі ваших конкретних вимог і побажань.
              </li>
            </ol>
          </BrandBookDefaultText>
          <BrandBookDefaultText>
            Крім того, ми пропонуємо <strong>розробка фірмового стилю</strong>{' '}
            (у тому числі й повний редизайн), коли ви хочете повністю змінити
            або вдосконалити візуальну складову. Завдяки комплексному підходу{' '}
            <strong>дизайн брендбука</strong> відповідає всім професійним
            стандартам, а саме <strong>брендбук приклад</strong>, який ви
            отримуєте, стане реперною точкою для всіх майбутніх рішень у
            брендингу.
          </BrandBookDefaultText>
        </SectionItemBlock>

        <SectionItemBlock>
          <ContactForm
            mainTitle={'Замовте розробку брендбука вже сьогодні!'}
            subTitle={
              <>
                Якщо ви прагнете підвищити рівень довіри до компанії, покращити
                впізнаваність і забезпечити команді єдину візуальну мову, тоді
                вам знадобиться <strong>розробка брендбука</strong>. Пам’ятайте,
                що <strong>бренд бук це</strong> довгострокова інвестиція у ваш
                бізнес, яка визначить загальну стилістику та комунікаційні
                підходи на роки вперед.
              </>
            }
          />

          <BrandBookDefaultText>
            Поспішайте виділитися серед конкурентів:{' '}
            <strong>створення брендбуку</strong> дасть змогу збільшити цінність
            вашої торгової марки, а добре продумані{' '}
            <strong>основні складові фірмового стилю</strong> допоможуть у
            побудові міцних зв’язків із цільовою аудиторією. Якщо ж ви хочете
            переглянути <strong>брендбук приклад</strong> або дізнатися більше
            про <strong>етапи розробки фірмового стилю</strong>, ми залюбки
            надамо всю необхідну інформацію.
          </BrandBookDefaultText>
          <BrandBookDefaultText>
            Залиште заявку для безкоштовної консультації та прорахунку вашого
            проєкту. Дізнайтеся, яким може бути ваш{' '}
            <strong>фірмовий стиль</strong>, і почніть{' '}
            <strong>створення фірмового стилю</strong> вже сьогодні!
          </BrandBookDefaultText>
        </SectionItemBlock>
      </BrandBookPageContainer>
    </MainBrandBookContainer>
  );
};

export default BrandBook;
