import { BurgerIcon } from 'components/Welcome/Welcome.styled';
import { NavLink } from 'react-router-dom';
import { BackArrow } from '../Services.styled';
import SideBarMenu from 'components/SideBarMenu/SideBarMenu';
import { useState } from 'react';
import {
  MainMotionContainer,
  MotionDefaultText,
  MotionMainTitle,
  MotionPageContainer,
  MotionSubTitle,
  SectionItemBlock,
} from './Motion.styled';
import TwoExamplesBanners from 'addition/TwoExamplesBanners/TwoExamplesBanners';
import ServicesList from 'addition/ServicesList/ServicesList';
import ContactForm from 'addition/ContactForm/ContactForm';
import { WhyWeMainText } from '../Baners/Baners.styled';
import StarAndText from 'addition/StarAndText/StarAndText';

const Motion = () => {
  const [sidebarSwitcher, setSidebarSwitcher] = useState(false); // Стейт для управления состоянием меню

  const onClickGood = () => {
    setSidebarSwitcher(prevState => !prevState); // Переключение состояния меню
  };

  const firstList = [
    <>
      <strong>Моушн графіка</strong> допомагає захопити увагу аудиторії навіть у
      переповненому інформацією середовищі.
    </>,
    <>
      <strong>Моушн дизайн</strong> дозволяє перетворити складні дані на
      доступну форму, що ідеально підходить для{' '}
      <strong>відео для соцмереж</strong> або маркетингових кампаній.
    </>,
    <>
      Використовуючи <strong>анімація для бізнесу</strong>, ви досягаєте легкого
      та ненав’язливого пояснення особливостей продукту, що впливає на{' '}
      <strong>анімація логотипів</strong>, інфографіку та інші динамічні
      елементи.
    </>,
    <>
      Професійне втілення — це гарантоване{' '}
      <strong>підвищення впізнаваності бренду</strong>, адже оригінальні
      візуальні рішення швидко запам’ятовуються.
    </>,
    <>
      <strong>Розробка відеоконтенту</strong> на базі сучасних технологій та{' '}
      <strong>анімація для привернення уваги</strong> сприяє тому, що ваша
      реклама чи освітній матеріал стане інтерактивним і більш дієвим.
    </>,
    <>
      {' '}
      Багато компаній обирають <strong>замовити анімаційне відео</strong> або
      використовують <strong>моушн графіка для youtube</strong>, щоб вигідно
      виділитися у конкурентному середовищі. Цей крок значно підсилює{' '}
      <strong>моушн дизайн для просування</strong> продукції.{' '}
    </>,
  ];

  // const secondList = [
  //   <>
  //     <strong>Налаштування веб аналітики</strong>. Ми допомагаємо інтегрувати
  //     такі інструменти, як Google Analytics, Google Tag Manager, Hotjar тощо,
  //     щоб дані збиралися якісно та повно.
  //   </>,
  //   <>
  //     <strong>Відстеження ключових показників (KPI) і конверсій</strong>. Ми
  //     формуємо зручні панелі моніторингу, які дозволяють отримувати аналітику в
  //     реальному часі й швидко реагувати на зміни.{' '}
  //   </>,
  //   <>
  //     {' '}
  //     <strong>Створення персоналізованих звітів для бізнесу</strong>. Наші
  //     спеціалісти аналізують найважливіші аспекти: від трафіку до{' '}
  //     <strong>аналізу даних в excel</strong>, щоб легко впроваджувати корективи.
  //   </>,
  //   <>
  //     <strong>Аналіз ефективності маркетингових кампаній</strong>. Ми детально
  //     оцінюємо витрати та результати, використовуючи{' '}
  //     <strong>аналіз сайтів</strong> у поєднанні з показниками конверсії. Такий{' '}
  //     <strong>аналіз даних</strong> допомагає виділити найефективніші канали
  //     просування.
  //   </>,
  //   <>
  //     <strong>Оптимізація сайту</strong> на підставі отриманої статистики.
  //     Завдяки повній картині взаємодії користувачів із ресурсом ми пропонуємо
  //     конкретні кроки, що сприяють зростанню продажів і покращенню позицій у
  //     пошукових системах.
  //   </>,
  // ];

  const WhyWeList = [
    <>
      Наша команда об’єднує талановитих експертів, які мають глибокі знання в
      галузі анімації та дизайну.
    </>,
    <>
      Ми пропонуємо комплексні <strong>послуги моушн дизайну</strong>, що
      охоплюють дослідження бренду й планування концепції, аби ваші{' '}
      <strong>анімаційні промо ролики</strong> чи{' '}
      <strong>відео для соцмереж</strong> приносили відчутний результат.
    </>,
    <>
      Працюючи з нами, ви можете бути впевненими у високій якості та швидкому
      виконанні проекту.
    </>,
  ];

  return (
    <MainMotionContainer>
      <BurgerIcon onClick={onClickGood} className="good" />
      <NavLink to="/" style={{ textDecoration: 'none' }}>
        <BackArrow />
      </NavLink>
      <SideBarMenu isOpen={sidebarSwitcher} />
      <MotionPageContainer>
        <SectionItemBlock>
          <MotionMainTitle>Моушн дизайн: оживіть свої ідеї</MotionMainTitle>
          <TwoExamplesBanners />
          <MotionDefaultText>
            Прагнете створити якісний динамічний контент для розвитку свого
            бренду? Саме тут <strong>моушн дизайн</strong> допоможе втілити
            найсміливіші концепції у життя. Це сучасний підхід, що передбачає{' '}
            <strong>анімація для привернення уваги</strong> та візуальний
            супровід будь-якої історії, аби зацікавити аудиторію. Уявіть, як
            ваші послуги чи товари «оживають» у <strong>відео</strong>,
            захоплюючи глядачів із перших секунд. Зверніть увагу, що{' '}
            <strong>моушн дизайн Україна</strong> розвивається шаленими темпами:
            дедалі більше компаній використовують <strong>моушн графіка</strong>{' '}
            у презентаціях, соцмережах і рекламних кампаніях. Крім того,{' '}
            <strong>анімація для бізнесу</strong> охоплює такі напрями, як
            промо-ролики, освітні відеоуроки та навіть інтерактивний контент.
            Якщо ж ви зацікавлені в унікальних ідеях, зверніть увагу на{' '}
            <strong>розробка анімацій</strong> – від мінімалістичних GIF до
            кінематографічних заставок. Актуальним трендом лишається й{' '}
            <strong>анімація логотипів</strong>, що додає бренду оригінальності.
            До того ж, сьогодні важливо не лише створювати ролики, а й займатися{' '}
            <strong>розробка відеоконтенту</strong> комплексно, адаптуючи
            анімацію під різні платформи.
          </MotionDefaultText>
        </SectionItemBlock>

        <SectionItemBlock>
          <MotionSubTitle>Що таке моушн дизайн?</MotionSubTitle>
          <MotionDefaultText>
            Основна суть моушн-дизайну полягає в тому, щоб передавати ідеї через
            рухомі зображення. Така{' '}
            <strong>анімація для привернення уваги</strong> дає змогу швидко та
            ефективно донести складну інформацію до потенційних клієнтів.
            Будь-яке <strong>відео</strong>, створене в цій техніці, стає
            динамічним і захопливим, що сприяє кращому засвоєнню повідомлення.
            Власне, <strong>моушн дизайн для просування</strong> передбачає не
            лише яскраві ефекти, а й логічну побудову сюжету, аби досягнути{' '}
            <strong>підвищення впізнаваності бренду</strong>. Нерідко наші
            фахівці пропонують <strong>замовити моушн дизайн</strong> для
            створення коротких роликів, презентацій чи{' '}
            <strong>анімаційні промо ролики</strong> з акцентом на конкретних
            перевагах товару. Також практикується{' '}
            <strong>анімація для маркетингу</strong>, що дає змогу виділити
            унікальні властивості продукту. Якщо бажаєте зробити якісний ривок
            уперед, радимо звернутися до спеціалістів, які пропонують{' '}
            <strong>моушн дизайн під ключ</strong>, — від ідеї до фінального
            результату. А окремий вектор розвитку — це{' '}
            <strong>створення відео для бренду</strong>, що допомагає візуально
            відобразити філософію компанії.
          </MotionDefaultText>

          <ServicesList title={'Переваги моушн дизайну'} data={firstList} />

          <MotionDefaultText>
            Оскільки <strong>моушн дизайн україна</strong> активно розвивається,
            ми стежимо за світовими трендами та застосовуємо найактуальніші
            підходи. При цьому пропонуємо <strong>моушн дизайн</strong>{' '}
            (розбавлене вживання) на рівні, який відповідає очікуванням
            міжнародних брендів. У нашому портфоліо — від коротких інтро до
            масштабних рекламних кампаній, і цей досвід дає змогу виконати{' '}
            <strong>створення відео для бренду</strong> з урахуванням усіх
            нюансів. Крім того, ми прагнемо персоналізувати кожен проєкт, тож ви
            можете <strong>замовити моушн дизайн</strong> із будь-яким рівнем
            складності.
          </MotionDefaultText>
          <MotionSubTitle>
            Замовте моушн дизайн для свого бізнесу вже сьогодні!
          </MotionSubTitle>
          <MotionDefaultText>
            {' '}
            У сучасних реаліях <strong>анімація логотипів</strong> та інші
            динамічні елементи відіграють вирішальну роль у формуванні
            позитивного іміджу. Якщо вам потрібен масштабний проект чи{' '}
            <strong>розробка анімацій</strong> для окремого продукту, ми готові
            допомогти. Наші <strong>послуги моушн дизайну</strong> охоплюють
            також <strong>моушн дизайн для реклами</strong>, освітні ресурси й
            корпоративні презентації, що забезпечують{' '}
            <strong>підвищення впізнаваності бренду</strong>.
          </MotionDefaultText>
          <MotionDefaultText>
            Ми виконуємо <strong>моушн дизайн для просування</strong> у різних
            середовищах: від ТБ до діджитал-платформ, роблячи акцент на
            творчість і практичне застосування. До того ж,{' '}
            <strong>моушн дизайн під ключ</strong> дозволяє передавати кожну
            деталь вашого стилю у динаміці, а{' '}
            <strong>анімація для маркетингу</strong> посилить емоційний зв’язок
            із клієнтами. Сьогодні популярні ролики на YouTube — саме тут стає в
            пригоді <strong>моушн графіка для youtube</strong>, тоді як для
            активних інстаграм-акаунтів найбільш доречним є{' '}
            <strong>створення відео для instagram</strong>.
          </MotionDefaultText>
          <MotionDefaultText>
            Якщо ви бажаєте отримати швидкий результат, що забезпечить{' '}
            <strong>підвищення впізнаваності бренду</strong> та посилить зв’язок
            із цільовою аудиторією, вибирайте{' '}
            <strong>моушн дизайн для реклами</strong> і переконайтеся в силі
            динамічного контенту. Не зволікайте —{' '}
            <strong>розробка анімацій</strong>, створення{' '}
            <strong>анімаційні промо ролики</strong> або{' '}
            <strong>відео для соцмереж</strong> підсилять вашу рекламну
            стратегію та допоможуть закріпитися на ринку.
          </MotionDefaultText>
          <MotionDefaultText>
            Створіть контент, який запам’ятається вашій аудиторії. Залиште
            заявку на консультацію та отримайте прорахунок вашого проєкту
          </MotionDefaultText>
        </SectionItemBlock>

        <SectionItemBlock>
          <ContactForm
            mainTitle={'Залишайте заявку просто зараз!'}
            subTitle={
              <>
                Оживіть свій бренд та виведіть його на новий рівень завдяки
                високоякісній анімації. Зробіть перший крок:{' '}
                <strong>замовити моушн дизайн</strong> або{' '}
                <strong>замовити анімаційне відео</strong> — і переконайтеся,
                наскільки ефективним стане ваш маркетинг. Ми надаємо{' '}
                <strong>послуги моушн дизайну</strong>, які підкреслять
                унікальність вашого продукту, а{' '}
                <strong>моушн дизайн україна</strong> допоможе вам виділитися
                серед конкурентів.
              </>
            }
          />
        </SectionItemBlock>

        <SectionItemBlock>
          {' '}
          <WhyWeMainText>Чому обирають нас?</WhyWeMainText>
          {WhyWeList.map(item => {
            return <StarAndText text={item} />;
          })}
        </SectionItemBlock>
      </MotionPageContainer>
    </MainMotionContainer>
  );
};

export default Motion;
