import { BurgerIcon } from 'components/Welcome/Welcome.styled';
import {
  MainWebAnaliticsContainer,
  WebAnaliticsDefaultText,
  WebAnaliticsMainTitle,
  WebAnaliticsPageContainer,
  WebAnaliticsSubTitle,
  WhyWeMainText,
} from './WebAnalitics.styled';
import { NavLink } from 'react-router-dom';
import { BackArrow } from '../Services.styled';
import SideBarMenu from 'components/SideBarMenu/SideBarMenu';
import { useState } from 'react';
import TwoExamplesBanners from 'addition/TwoExamplesBanners/TwoExamplesBanners';
import ServicesList from 'addition/ServicesList/ServicesList';
import ContactForm from 'addition/ContactForm/ContactForm';
import StarAndText from 'addition/StarAndText/StarAndText';

const WebAnalitics = () => {
  const [sidebarSwitcher, setSidebarSwitcher] = useState(false); // Стейт для управления состоянием меню

  const onClickGood = () => {
    setSidebarSwitcher(prevState => !prevState); // Переключение состояния меню
  };

  const firstList = [
    <>
      <strong>Збір даних про відвідувачів сайту</strong>. Тут ідеться про
      джерела трафіку, географію, демографічні показники. Детальний{' '}
      <strong>аналіз структури сайту</strong> дає змогу знайти «вузькі» місця та
      скоригувати навігацію.
    </>,
    <>
      <strong>Аналіз поведінки користувачів</strong>. Інформація про відвідані
      сторінки, тривалість сеансу та дії на сайті є основою для{' '}
      <strong>етапи аналізу даних</strong> — саме тоді визначається, на яких
      кроках відвідувачі покидають сторінку чи, навпаки, переходять до покупки.
    </>,
    <>
      <strong>Відстеження ефективності рекламних кампаній</strong>. Розрахунок
      ROI та конверсій допомагає зрозуміти, наскільки вигідно вкладати кошти в
      конкретні канали реклами. Саме тут стає важливою{' '}
      <strong>seo оптимізація</strong>, що впливає на органічний трафік і
      позиції у пошукових системах.
    </>,
    <>
      <strong>Виявлення слабких місць у користувацькому досвіді (UX)</strong>.
      Глибокий <strong>аналіз веб сайту</strong>, зокрема{' '}
      <strong>аналіз юзабіліті сайту</strong>, дає змогу виявити, що саме
      заважає людям успішно здійснювати покупки чи заповнювати форми. Отримані
      дані стають фундаментом для поліпшення конверсій і{' '}
      <strong>оптимізація сайту</strong> загалом.
    </>,
  ];

  const secondList = [
    <>
      <strong>Налаштування веб аналітики</strong>. Ми допомагаємо інтегрувати
      такі інструменти, як Google Analytics, Google Tag Manager, Hotjar тощо,
      щоб дані збиралися якісно та повно.
    </>,
    <>
      <strong>Відстеження ключових показників (KPI) і конверсій</strong>. Ми
      формуємо зручні панелі моніторингу, які дозволяють отримувати аналітику в
      реальному часі й швидко реагувати на зміни.
    </>,
    <>
      <strong>Створення персоналізованих звітів для бізнесу</strong>. Наші
      спеціалісти аналізують найважливіші аспекти: від трафіку до{' '}
      <strong>аналізу даних в excel</strong>, щоб легко впроваджувати корективи.
    </>,
    <>
      <strong>Аналіз ефективності маркетингових кампаній</strong>. Ми детально
      оцінюємо витрати та результати, використовуючи{' '}
      <strong>аналіз сайтів</strong> у поєднанні з показниками конверсії. Такий{' '}
      <strong>аналіз даних</strong> допомагає виділити найефективніші канали
      просування.
    </>,
    <>
      <strong>Оптимізація сайту</strong> на підставі отриманої статистики.
      Завдяки повній картині взаємодії користувачів із ресурсом ми пропонуємо
      конкретні кроки, що сприяють зростанню продажів і покращенню позицій у
      пошукових системах.
    </>,
  ];

  const whyWeList = [
    <>
      {' '}
      Ми маємо команду досвідчених аналітиків, котрі використовують актуальні
      методи та інструменти для обробки інформації.
    </>,
    <>
      Ми робимо не лише <strong>аналіз сайта</strong> з точки зору трафіку, а й
      глибоко занурюємося у{' '}
      <strong>пошукова оптимізація та просування веб сайтів</strong>, аби
      підвищити видимість у мережі.
    </>,
    <>
      Наш індивідуальний підхід до кожного проєкту означає, що ми приділяємо
      увагу всім аспектам: від <strong>аналізу даних в excel</strong> до
      визначення <strong>класи оптимізацій сайтів</strong>.
    </>,
    <>
      {' '}
      Крім того, наші рекомендації мають зрозумілий формат, а регулярна
      звітність дозволяє оцінити прогрес у режимі реального часу.
    </>,
  ];

  return (
    <MainWebAnaliticsContainer>
      <BurgerIcon onClick={onClickGood} className="good" />
      <NavLink to="/" style={{ textDecoration: 'none' }}>
        <BackArrow />
      </NavLink>
      <SideBarMenu isOpen={sidebarSwitcher} />
      <WebAnaliticsPageContainer>
        <WebAnaliticsMainTitle>
          Веб-аналітика: ефективний інструмент для розвитку бізнесу
        </WebAnaliticsMainTitle>
        <WebAnaliticsDefaultText>
          В епоху цифрових технологій <strong>веб аналітика</strong> набуває
          особливого значення для компаній, що прагнуть збільшити впізнаваність
          бренду та підвищити продажі. Вона дає змогу отримати детальну
          інформацію про дії відвідувачів, удосконалити маркетингові стратегії
          та зрозуміти, що саме впливає на прибутковість. Але{' '}
          <strong>веб аналітика це</strong> не просто збирання статистики — це
          повноцінний процес, який охоплює <strong>аналіз даних</strong>,{' '}
          <strong>аналіз веб сайту</strong>, а також{' '}
          <strong>seo оптимізація</strong> та вдосконалення користувацького
          досвіду.
        </WebAnaliticsDefaultText>
        <TwoExamplesBanners />
        <WebAnaliticsSubTitle>Що таке веб-аналітика?</WebAnaliticsSubTitle>
        <WebAnaliticsDefaultText>
          <strong>Веб аналітика</strong> — це комплекс підходів і методик, який
          дає змогу досліджувати, як користувачі взаємодіють із вашим
          веб-ресурсом. Вона охоплює <strong>аналіз сайту</strong>, відстеження
          поведінки відвідувачів, оцінку ефективності рекламних кампаній і
          навіть <strong>аналіз великих даних</strong> для пошуку
          закономірностей. У сучасних умовах саме <strong>аналіз сайта</strong>{' '}
          є критичним елементом розвитку: він допомагає визначити, звідки
          надходить трафік, скільки часу люди проводять на сторінках і які шляхи
          взаємодії з інтерфейсом найбільш продуктивні.
        </WebAnaliticsDefaultText>
        <WebAnaliticsDefaultText>
          Завдяки <strong>аналізу даних</strong> компанії можуть приймати
          виважені рішення, покращуючи контент, дизайн і функціонал веб-ресурсу.
          Важливим аспектом стає і <strong>аналіз сайту конкурентів</strong>, що
          дозволяє дізнатися, у чому полягають сильні й слабкі сторони вашого
          сегмента ринку. Крім того,{' '}
          <strong>
            поняття пошукової оптимізації та просування веб сайтів
          </strong>{' '}
          тісно пов’язане з веб-аналітикою, оскільки тільки глибоке розуміння
          поведінки аудиторії допомагає визначити, які SEO-стратегії будуть
          найбільш результативними.
        </WebAnaliticsDefaultText>
        <WebAnaliticsDefaultText>
          У результаті <strong>аналіз даних це</strong> спосіб виявити
          закономірності та тренди, які дозволять корегувати стратегії й
          розвивати бізнес. Тому{' '}
          <strong>пошукова оптимізація та просування веб сайтів</strong> повинні
          будуватися саме на чіткій статистиці та детальному розумінні потреб
          аудиторії.
        </WebAnaliticsDefaultText>
        <ServicesList
          title={'Основні можливості веб-аналітики'}
          data={firstList}
        />
        <ServicesList
          title={'Наші послуги з веб-аналітики'}
          data={secondList}
        />
        <WebAnaliticsDefaultText>
          Часто наші клієнти замовляють також{' '}
          <strong>аналіз сайту онлайн</strong>, коли потрібно швидко оцінити
          нинішню ситуацію з трафіком і поведінкою користувачів. На додачу ми
          здійснюємо <strong>аналіз та візуалізація даних</strong>, що дає змогу
          переглядати інформацію у зручних графіках і таблицях, а це пришвидшує
          ухвалення управлінських рішень.
        </WebAnaliticsDefaultText>
        <WebAnaliticsDefaultText>
          Відстежуйте кожен клік і конверсію та отримуйте{' '}
          <strong>оптимізацію сайту</strong> відповідно до реальних потреб
          аудиторії. Почніть із простого кроку — залиште заявку на професійний{' '}
          <strong>аналіз сайта</strong>. Пам’ятайте, що{' '}
          <strong>пошукова оптимізація та просування веб сайтів</strong>{' '}
          базуються на якісних даних, а вдумливий <strong>аналіз сайтів</strong>{' '}
          і їхнє покращення — запорука вашого успіху.
        </WebAnaliticsDefaultText>
        <WebAnaliticsDefaultText>
          {' '}
          <em>
            {' '}
            Аналітика відкриває двері до нових можливостей: від{' '}
            <strong>аналізу сайту конкурентів</strong> і{' '}
            <strong>аналізу юзабіліті сайту</strong> до повноцінного{' '}
            <strong>аналізу великих даних</strong>. Спробуйте{' '}
            <strong>налаштування веб аналітики</strong> уже сьогодні й відчуйте,
            як швидко ваш сайт переходить на новий рівень.{' '}
          </em>{' '}
        </WebAnaliticsDefaultText>
        <ContactForm
          mainTitle={'Замовте послуги з веб-аналітики вже сьогодні!'}
          subTitle={
            <>
              Якщо ви бажаєте дізнатися, що саме впливає на продажі та як
              поліпшити кожен етап взаємодії з користувачами, не варто
              зволікати. Скористайтеся глибинним{' '}
              <strong>аналізом веб сайту</strong> та підвищте його ефективність.
              Розкрийте власний потенціал, адже <strong>аналіз даних це</strong>{' '}
              не лише статистика — це ключ до масштабування вашого бізнесу. Наша
              компанія розробить індивідуальну стратегію, охоплюючи{' '}
              <strong>
                поняття пошукової оптимізації та просування веб сайтів
              </strong>{' '}
              і всі суміжні процеси, включно з <strong>seo оптимізація</strong>.{' '}
            </>
          }
        />
        <WhyWeMainText>Чому варто обрати нас?</WhyWeMainText>
        {whyWeList.map(item => {
          return <StarAndText text={item} />;
        })}
      </WebAnaliticsPageContainer>
    </MainWebAnaliticsContainer>
  );
};

export default WebAnalitics;
